archive/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition/000.Preface_and_New_Features/000.000.Notes.org
#+title: Chapter 0: Preface & New Features
#+author: Alfredo Mejia
#+options: num:nil html-postamble:nil
#+html_head: <link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /> <style>body {margin: 5%} h1,h2,h3,h4,h5,h6 {margin-top: 3%}</style>

* Navigation
| Nav   | Title                                                            | Links                                   |
|-------+------------------------------------------------------------------+-----------------------------------------|
| Index | Notes Home                                                       | \vert [[file:../../index.html][html]] \vert [[file:../../index.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main][github]] \vert |
| Home  | User's Guide for Oracle Business Intelligence Enterprise Edition | \vert [[file:../000.Home.html][html]] \vert [[file:../000.Home.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition][github]] \vert |
| Prev  |                                                                  |                                         |
| Next  | Chapter 1: Introducing Oracle Business Intelligence              | \vert [[file:../001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition/001.000.Notes.html][html]] \vert [[file:./001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition/001.000.Notes.org][org]] \vert [[https://github.com/alfredo-mejia/notes/tree/main/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition/001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition][github]] \vert |

* Notes

** Section 1.1: Preface
   - The Oracle Business Intelligence Foundation Suite is a complete, open, and integrated solution for all enterprise business intelligence needs including reporting, ad-hoc queries, OLAP (Online Analytical Processing), dashbords, scorecards, and what-if analysis
   - Oracle Business Intelligence Foundation Suite includes Oracle Business Intelligence Enterprise Edition
   - Oracle Business Intelligence Enterprise Edition (OBIEE) is a comprehensive set of enterprise business intelligence tools and infrastructure, including a scalable and efficient query and analysis server, an ad-hoc query and analysis tool, interactive dashboards, proactive intelligence and alerts, and an enterprise reporting engine
   - [[https://docs.oracle.com/middleware/bi12214/bisuite/index.html][Oracle Docs Home for Oracle Business Intelligence Suite 12.2.1.4.0]]

** Section 1.2: New Features for Oracle Business Intelligence Users
   - Enhacements to graphs
   - Enhacements to views
   - Enhacement to analyses
   - Enhacement to scorecards
   - Enhacement to dashboards
   - New home page
   
* Keywords
| Term           | Definition                                                                                                                                                                                                                                                              |
|----------------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| OBIEE          | Oracle Business Intelligence Enterprise Edition (a complete, open, and integrated solution for all enterprise business intelligence needs)                                                                                                                              |
| Ad-hoc Queries | A user-defined query that allows the user to access and analyze data to answer specific questions (this query is flexible and specific that is often used on the fly to help analysts answer specific questions). For example, what age group buys the most on Fridays? |
| OLAP           |                                                                                                                                                                                                                                                                         |

* Questions
  - *Q*: What are ad hoc queries?
         - [[https://www.thoughtspot.com/data-trends/analytics/ad-hoc-analysis-and-reporting/what-is-an-ad-hoc-query][StackOverFlow Answer]]
	 - [[https://www.thoughtspot.com/data-trends/analytics/ad-hoc-analysis-and-reporting/what-is-an-ad-hoc-query][ThoughtSpot Ad-hoc Article]]
	 - Ad-hoc queries are queries that are created for specific purposes to gather information that is needed right now thus the query is loosely created or created on the fly because we need some information right now from the data
	 - How is this important for OBIEE? Well if a Oracle customer has a bunch of data, let's say data about their customers, then they can create ad-hoc queries to find out: what is the common age group? where do they live? what do they buy?
	 - Questions can be quickly answered from the data, basically filtering and answering questions by these ad-hoc queries
	 - Plus these ad-hoc queries are questions that need to be answered now thus these queries might not be run again later or may change in the answer if it is run later
	 - These seems like regular queries to me, so why the name? The difference is ad-hoc queries are used "on the fly" by data analysts that are exploring answers and researching and filtering the data. These queries tend to be short and quickly created. Compare this to stored procedures, these queries are typically longer and follow some chronological order but this is because we are not trying to answer a new question now but rather see if the answer of a previous question has changed
	 - Thus stored procedures are different than ad-hoc queries because stored procedures are running the same query throughout different times
	   
  - *Q*: What is OLAP (Online Analytical Processing)?
         - [[https://aws.amazon.com/what-is/olap/][Amazon Answer]]
	 - According the AWS, "OLAP is a software technology you can use to analyze business data from different points of views"
	 - How is that achieved?
	 - Organizations collect data from multiple data sources, OLAP combines this data and prepares the data
	 - Once OLAP preps the collection of data, OLAP tools are used to query and generate reports to provide actionable insights
	 - How does that work?
	 - According to AWS, OLAP systems store *multidimensional data*
	 - What is multidimensional data?
	 - According to this [[https://blog.virtualitics.com/what-is-multidimensional-data][blog]] from Virtualitics, multidimensional data is a data set with many different columns also called features or attributes
	 - For example, this [[https://www.geeksforgeeks.org/multidimensional-data-model/][post]] from GeeksForGeeks provides an excellent example, let's say we have the following relational tables:
	   *Location Table*
	   | ID | Location    |
	   |----+-------------|
	   |  1 | Los Angeles |
	   |  2 | Boston      |
	   |  3 | Miami       |

	   *Item Table*
	   | ID | Item         |
	   |----+--------------|
	   |  1 | Bananas      |
	   |  2 | Strawberries |
	   |  3 | Watermelons  |
	   |  4 | Apples       |

	   *Sales Table*
           | ID |       Date | Item | Location | Amount |
           |----+------------+------+----------+--------|
           |  1 |  1-12-2024 |    1 |        3 |     10 |
           |  2 |  1-30-2024 |    1 |        2 |      9 |
           |  3 | 10-10-2024 |    4 |        1 |     15 |
           |  4 |  12-5-2024 |    3 |        3 |     20 |
           |  5 |   4-5-2024 |    2 |        3 |      8 |
           |  6 |   3-5-2024 |    1 |        1 |     12 |
           |  7 |  10-1-2024 |    3 |        2 |     20 |
           |  8 | 11-25-2024 |    4 |        2 |     14 |
           |  9 |  5-29-2024 |    2 |        2 |     20 |
           | 10 |  2-19-2024 |    4 |        1 |     20 |

	 - From the tables above can we answer the question: Which item was sold the most in quarter 1 in Los Angeles?
	 - Possibly but it seems to hard to answer questions like that which is why relational databases are not used when it comes to the multidimensional data model
	 - Instead we use cube (multidimensonal shapes)
	 - So instead we group our sales based on location. Now we have all sales based on location (one attribute or feature)
	 - We also group our sales based on quarter to further group our sales thus we convert the date into quarters. Thus we have the sale for each location for each quarter.
	 - Then we group our sales based on item. Thus we have our sales based on location, quarter, and item
	 - So now it looks something like this: [[file:./000.003.Questions/q2.cube_table_example.pdf][cube table]]
         - Notice how the features or "columns" are the quarter, location, and items
	 - This forms a cube because it has 3 dimensions, sometimes you can have more than 3 dimensions but to keep it simple for now we have 3 dimensions
	 - Returning to the question: Which item was sold the most in quarter 1 in Los Angeles?
	 - Now it is super easy to answer because we have the dimensions, we see the Los Angeles only had 3 sales and only one sale in quarter 1 thus the answer is bananas
	 - Sometimes aggregation is used because what if we have multiple sales for bananas and we want to know the total sum of the most sold item in Los Angeles in quarter 1. Well we use aggregate sum but in our example we have very little data
	 - Some keywords to note, measures are the numerical data such as the sales or revenue, dimensions are the columns or attributes that describe the measures (e.g. Los Angeles, Q1, Bananas leads us to 12), cubes are the structures that represent the multidimensional relationships between measures and dimensions in a data model, and aggregation is the process of summarizing data across dimensions and levels of detail

	 - Going back to OLAP, OLAP server collects data from multiple data sources including relational databases and data warehouses
	 - Then OLAP cleans, transforms, aggregate, precalculate and store data in an OLAP cube according to the number of dimensions specified (e.g. how we converted date into quarters and used that as one of our dimensions)
	 - Then business analysts use OLAP tools to query and generate reports from the multidimensional data in the OLAP cube to answer business questions and see insightful trends

	 - Thus OLAP is a technology that transforms data into multidimensional data and uses tools to query and generate reports from the multidimensional data (cubes) to answer business questions and see business trends
	   
  - *Q*: What is a data warehouse?

* Summary

* Resources
  - https://aws.amazon.com/what-is/olap/
  - https://www.geeksforgeeks.org/multidimensional-data-model/
