archive/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition/000.Preface_and_New_Features/000.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-07 Tue 12:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 0: Preface &amp; New Features</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../resources/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Chapter 0: Preface &amp; New Features</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org48a588b">Navigation</a></li>
<li><a href="#org6af8f9c">Notes</a>
<ul>
<li><a href="#org5ac96ac">Section 1.1: Preface</a></li>
<li><a href="#orgcfa4572">Section 1.2: New Features for Oracle Business Intelligence Users</a></li>
</ul>
</li>
<li><a href="#org89ace8b">Keywords</a></li>
<li><a href="#org9d99fe3">Questions</a></li>
<li><a href="#org39d9dde">Summary</a></li>
<li><a href="#orga81e0ff">Resources</a></li>
</ul>
</div>
</div>

<div id="outline-container-org48a588b" class="outline-2">
<h2 id="org48a588b">Navigation</h2>
<div class="outline-text-2" id="text-org48a588b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Nav</th>
<th scope="col" class="org-left">Title</th>
<th scope="col" class="org-left">Links</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Index</td>
<td class="org-left">Notes Home</td>
<td class="org-left">&vert; <a href="../../index.html">html</a> &vert; <a href="../../index.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Home</td>
<td class="org-left">User's Guide for Oracle Business Intelligence Enterprise Edition</td>
<td class="org-left">&vert; <a href="../000.Home.html">html</a> &vert; <a href="../000.Home.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition">github</a> &vert;</td>
</tr>

<tr>
<td class="org-left">Prev</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Next</td>
<td class="org-left">Chapter 1: Introducing Oracle Business Intelligence</td>
<td class="org-left">&vert; <a href="../001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition/001.000.Notes.html">html</a> &vert; <a href="./001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition/001.000.Notes.html">org</a> &vert; <a href="https://github.com/alfredo-mejia/notes/tree/main/Users_Guide_for_Oracle_Business_Intelligence_Enterprise_Edition/001.Introducing_Oracle_Business_Intelligence_Enterprise_Edition">github</a> &vert;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6af8f9c" class="outline-2">
<h2 id="org6af8f9c">Notes</h2>
<div class="outline-text-2" id="text-org6af8f9c">
</div>
<div id="outline-container-org5ac96ac" class="outline-3">
<h3 id="org5ac96ac">Section 1.1: Preface</h3>
<div class="outline-text-3" id="text-org5ac96ac">
<ul class="org-ul">
<li>The Oracle Business Intelligence Foundation Suite is a complete, open, and integrated solution for all enterprise business intelligence needs including reporting, ad-hoc queries, OLAP (Online Analytical Processing), dashbords, scorecards, and what-if analysis</li>
<li>Oracle Business Intelligence Foundation Suite includes Oracle Business Intelligence Enterprise Edition</li>
<li>Oracle Business Intelligence Enterprise Edition (OBIEE) is a comprehensive set of enterprise business intelligence tools and infrastructure, including a scalable and efficient query and analysis server, an ad-hoc query and analysis tool, interactive dashboards, proactive intelligence and alerts, and an enterprise reporting engine</li>
<li><a href="https://docs.oracle.com/middleware/bi12214/bisuite/index.html">Oracle Docs Home for Oracle Business Intelligence Suite 12.2.1.4.0</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcfa4572" class="outline-3">
<h3 id="orgcfa4572">Section 1.2: New Features for Oracle Business Intelligence Users</h3>
<div class="outline-text-3" id="text-orgcfa4572">
<ul class="org-ul">
<li>Enhacements to graphs</li>
<li>Enhacements to views</li>
<li>Enhacement to analyses</li>
<li>Enhacement to scorecards</li>
<li>Enhacement to dashboards</li>
<li>New home page</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org89ace8b" class="outline-2">
<h2 id="org89ace8b">Keywords</h2>
<div class="outline-text-2" id="text-org89ace8b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">OBIEE</td>
<td class="org-left">Oracle Business Intelligence Enterprise Edition (a complete, open, and integrated solution for all enterprise business intelligence needs)</td>
</tr>

<tr>
<td class="org-left">Ad-hoc Queries</td>
<td class="org-left">A user-defined query that allows the user to access and analyze data to answer specific questions (this query is flexible and specific that is often used on the fly to help analysts answer specific questions). For example, what age group buys the most on Fridays?</td>
</tr>

<tr>
<td class="org-left">OLAP</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org9d99fe3" class="outline-2">
<h2 id="org9d99fe3">Questions</h2>
<div class="outline-text-2" id="text-org9d99fe3">
<ul class="org-ul">
<li><b>Q</b>: What are ad hoc queries?
<ul class="org-ul">
<li><a href="https://www.thoughtspot.com/data-trends/analytics/ad-hoc-analysis-and-reporting/what-is-an-ad-hoc-query">StackOverFlow Answer</a></li>
<li><a href="https://www.thoughtspot.com/data-trends/analytics/ad-hoc-analysis-and-reporting/what-is-an-ad-hoc-query">ThoughtSpot Ad-hoc Article</a></li>
<li>Ad-hoc queries are queries that are created for specific purposes to gather information that is needed right now thus the query is loosely created or created on the fly because we need some information right now from the data</li>
<li>How is this important for OBIEE? Well if a Oracle customer has a bunch of data, let's say data about their customers, then they can create ad-hoc queries to find out: what is the common age group? where do they live? what do they buy?</li>
<li>Questions can be quickly answered from the data, basically filtering and answering questions by these ad-hoc queries</li>
<li>Plus these ad-hoc queries are questions that need to be answered now thus these queries might not be run again later or may change in the answer if it is run later</li>
<li>These seems like regular queries to me, so why the name? The difference is ad-hoc queries are used "on the fly" by data analysts that are exploring answers and researching and filtering the data. These queries tend to be short and quickly created. Compare this to stored procedures, these queries are typically longer and follow some chronological order but this is because we are not trying to answer a new question now but rather see if the answer of a previous question has changed</li>
<li>Thus stored procedures are different than ad-hoc queries because stored procedures are running the same query throughout different times</li>
</ul></li>

<li><b>Q</b>: What is OLAP (Online Analytical Processing)?
<ul class="org-ul">
<li><a href="https://aws.amazon.com/what-is/olap/">Amazon Answer</a></li>
<li>According the AWS, "OLAP is a software technology you can use to analyze business data from different points of views"</li>
<li>How is that achieved?</li>
<li>Organizations collect data from multiple data sources, OLAP combines this data and prepares the data</li>
<li>Once OLAP preps the collection of data, OLAP tools are used to query and generate reports to provide actionable insights</li>
<li>How does that work?</li>
<li>According to AWS, OLAP systems store <b>multidimensional data</b></li>
<li>What is multidimensional data?</li>
<li>According to this <a href="https://blog.virtualitics.com/what-is-multidimensional-data">blog</a> from Virtualitics, multidimensional data is a data set with many different columns also called features or attributes</li>
<li><p>
For example, this <a href="https://www.geeksforgeeks.org/multidimensional-data-model/">post</a> from GeeksForGeeks provides an excellent example, let's say we have the following relational tables:
<b>Location Table</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">ID</th>
<th scope="col" class="org-left">Location</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Los Angeles</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Boston</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Miami</td>
</tr>
</tbody>
</table>

<p>
<b>Item Table</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">ID</th>
<th scope="col" class="org-left">Item</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Bananas</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Strawberries</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Watermelons</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Apples</td>
</tr>
</tbody>
</table>

<p>
<b>Sales Table</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">ID</th>
<th scope="col" class="org-right">Date</th>
<th scope="col" class="org-right">Item</th>
<th scope="col" class="org-right">Location</th>
<th scope="col" class="org-right">Amount</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">1-12-2024</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">1-30-2024</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">9</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">10-10-2024</td>
<td class="org-right">4</td>
<td class="org-right">1</td>
<td class="org-right">15</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">12-5-2024</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">4-5-2024</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">8</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">3-5-2024</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">12</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">10-1-2024</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">11-25-2024</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">5-29-2024</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">20</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">2-19-2024</td>
<td class="org-right">4</td>
<td class="org-right">1</td>
<td class="org-right">20</td>
</tr>
</tbody>
</table></li>

<li>From the tables above can we answer the question: Which item was sold the most in quarter 1 in Los Angeles?</li>
<li>Possibly but it seems to hard to answer questions like that which is why relational databases are not used when it comes to the multidimensional data model</li>
<li>Instead we use cube (multidimensonal shapes)</li>
<li>So instead we group our sales based on location. Now we have all sales based on location (one attribute or feature)</li>
<li>We also group our sales based on quarter to further group our sales thus we convert the date into quarters. Thus we have the sale for each location for each quarter.</li>
<li>Then we group our sales based on item. Thus we have our sales based on location, quarter, and item</li>
<li>So now it looks something like this: <a href="./000.003.Questions/q2.cube_table_example.pdf">cube table</a></li>
<li>Notice how the features or "columns" are the quarter, location, and items</li>
<li>This forms a cube because it has 3 dimensions, sometimes you can have more than 3 dimensions but to keep it simple for now we have 3 dimensions</li>
<li>Returning to the question: Which item was sold the most in quarter 1 in Los Angeles?</li>
<li>Now it is super easy to answer because we have the dimensions, we see the Los Angeles only had 3 sales and only one sale in quarter 1 thus the answer is bananas</li>
<li>Sometimes aggregation is used because what if we have multiple sales for bananas and we want to know the total sum of the most sold item in Los Angeles in quarter 1. Well we use aggregate sum but in our example we have very little data</li>
<li>Some keywords to note, measures are the numerical data such as the sales or revenue, dimensions are the columns or attributes that describe the measures (e.g. Los Angeles, Q1, Bananas leads us to 12), cubes are the structures that represent the multidimensional relationships between measures and dimensions in a data model, and aggregation is the process of summarizing data across dimensions and levels of detail</li>

<li>Going back to OLAP, OLAP server collects data from multiple data sources including relational databases and data warehouses</li>
<li>Then OLAP cleans, transforms, aggregate, precalculate and store data in an OLAP cube according to the number of dimensions specified (e.g. how we converted date into quarters and used that as one of our dimensions)</li>
<li>Then business analysts use OLAP tools to query and generate reports from the multidimensional data in the OLAP cube to answer business questions and see insightful trends</li>

<li>Thus OLAP is a technology that transforms data into multidimensional data and uses tools to query and generate reports from the multidimensional data (cubes) to answer business questions and see business trends</li>
</ul></li>

<li><b>Q</b>: What is a data warehouse?</li>
</ul>
</div>
</div>

<div id="outline-container-org39d9dde" class="outline-2">
<h2 id="org39d9dde">Summary</h2>
</div>

<div id="outline-container-orga81e0ff" class="outline-2">
<h2 id="orga81e0ff">Resources</h2>
<div class="outline-text-2" id="text-orga81e0ff">
<ul class="org-ul">
<li><a href="https://aws.amazon.com/what-is/olap/">https://aws.amazon.com/what-is/olap/</a></li>
<li><a href="https://www.geeksforgeeks.org/multidimensional-data-model/">https://www.geeksforgeeks.org/multidimensional-data-model/</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
